# coding=utf-8

DSTableFactor = {"ElementaryFactor":[("日收益率","日收益率"),("是否在市","是否在市"),("交易状态","交易状态"),("上市天数","上市天数")]}

DSSysArgs = {"最大缓冲因子数":60,
             "向前缓冲日期数":630,
             "向后缓冲日期数":1}

ModelArgs = {"运行模式":"多进程",
             "子进程数":7,
             "因子数据库":"FactorDB",
             "收益率因子":"日收益率",
             "ID过滤条件":"(@是否在市==1) & (@上市天数>=30)"}

CovESTArgs = {"预测期数":21,
              "样本长度":250,
              "半衰期":125,
              "有效样本条件":"(@是否在市==1) & ((@交易状态==-1) | (@交易状态>0))"}

SaveArgs = {"风险数据库":"RDB",
            "风险数据表":"ShrinkageRiskData"}